# Avance Proyecto

In [1]:
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt

d002 -> Tarakawa, Kiribati (1.3320m 172.01300)
d003 -> Baltra, Ecuador (-0.43700, -90.28500)
d004 -> Nauru, Nauru (-0.52800, 166.90500)
d011 -> Christmas, Kiribati (1.98500, -157.47700)
d013 -> Kanton, Kiribati (-2.81000, -171.71800)
d029 -> Kapingamarangi, Micronesia (1.09800, 154.77700) 
d030 -> Santa Cruz, Ecuador (-0.75500, -90.31300)
d091 -> La Libertad, Ecuador (-2.20000, -80.91700)
d092 -> Talara, Peru (-4.58200, -81.28200)
d400 -> Lombrum, Papua New Guinea (-2.03300, 147.36700)

In [2]:
#Sea level datafram
df = pd.read_csv('data/sea level center/d002.csv', names=['Year', 'Month', 'Day', 'd002'])
df.head()

   Year  Month  Day  d002
0  1992     12    4  1711
1  1992     12    5  1693
2  1992     12    6  1671
3  1992     12    7  1680
4  1992     12    8  1700

In [4]:
# Merge

df_names = ['d003', 'd004', 'd011', 'd013', 'd029', 'd030', 'd091', 'd092', 'd400']

for n in df_names:
    path = 'data/sea level center/{}.csv'.format(n)
    d_right = pd.read_csv(path, names=['Year', 'Month', 'Day', n])
    df = df.merge(d_right, how='outer', on=['Year', 'Month', 'Day'])

In [6]:
df.sort_values(by=['Year', 'Month', 'Day'], inplace=True)
df.reset_index(inplace=True)
df

,index,Year,Month,Day,d002,d003,d004,d011,d013,d029,d030,d091,d092,d400
0,17957,1949,9,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2166.0,NaN,NaN
1,17958,1949,9,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2185.0,NaN,NaN
2,17959,1949,9,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2092.0,NaN,NaN
3,17960,1949,9,5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2081.0,NaN,NaN
4,17961,1949,9,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2130.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
26230,10431,2021,6,26,1692.0,1880.0,1507.0,NaN,1071.0,1029.0,1522.0,NaN,NaN,794.0
26231,10432,2021,6,27,1672.0,1905.0,1473.0,NaN,1052.0,1014.0,1512.0,NaN,NaN,790.0
26232,10433,2021,6,28,1658.0,1914.0,1460.0,NaN,1040.0,NaN,1509.0,NaN,NaN,802.0
26233,10434,2021,6,29,1678.0,1922.0,1480.0,NaN,1072.0,NaN,1504.0,NaN,NaN,814.0
26234,10435,2021,6,30,1694.0,1917.0,1493.0,NaN,1092.0,NaN,1511.0,NaN,NaN,824.0

In [7]:
df.to_csv('dataframe.csv')